/*(৭. তোমাকে যদি বলে একটা while লুপ দিয়ে ৭ থেকে ১৯ পর্যন্ত যতগুলা বিজোড় সংখ্যা আছে সেগুলা দেখাতে। তুমি কি সেটা দেখাতে পারবে? পারলে সেই কোড লিখে ফেলো। */

// let i = 7;
// while (i<=19){
//     // console.log(i);
//     if (i%2 != 0){
//         console.log(i)
//     }
//     i++
// }

/* ৮. তোমাকে যদি বলা হয় তুমি একটা array ডিক্লেয়ার করবে। এবং সেটার মধ্যে কয়টা উপাদান আছে সেটা বের করবে হবে। সেই array এর এর মধ্যে চতুর্থ পজিশন এর উপাদান চেইঞ্জ করতে হবে। array এর মধ্যে দুইটা উপাদান যোগ করতে হবে। এবং একটা উপাদান কে বের করে দিতে হবে। তুমি কি সেটা করতে পারবে।  */


/* ১০. তোমাকে যদি বলা হয়। একটা array এর মধ্যে ৮০ এর চাইতে বড় সংখ্যা থাকলে
 সেগুলাকে console log করে দেখাতে সেটা কি তুমি পারবে? তাহলে
  তুমি সেই কোড করে ফেলো */

const items = [ 10, 30, 80, 90, 120, 90, 40, 33,
     99, 88, 99, 79, 78, 77, 76, 80, 90, 111, 123, 112];
let result = [];
console.log('Before total array item is: '+items.length)
for (let item of items){
    if (item > 80){
        result.push(item);

    }
}
console.log(result);
console.log('After total array item is: '+result.length)